In [198]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [199]:
%sql mysql://root:1989@localhost:3306/attrition_analysis

##### Overview of the Data

In [216]:
%%sql
SELECT *
FROM case_attrition_mesotime
LIMIT 10;

 * mysql://root:***@localhost:3306/attrition_analysis
10 rows affected.

[('AAA_1', 'Trainee', 1, 104087, 'Female', 20, 'NA', 'New', '10 months', 0, 0, 15.0, '16-Sep', 'Better opportunity', 'Vol', 'SCM', 4, 'Junior Level'),
 ('AAA_10', 'Trainee', 1, 107493, 'Male', 22, 'NA', 'New', '3 months', 0, 0, 30.0, '17-Mar', 'Background Check Failure', 'InVol', 'Sales & Promotion', 2, 'Junior Level'),
 ('AAA_100', 'Senior Manager', 6, 3185934, 'Male', 44, 'NA', 'Old', '9', 13, 22, 7.5, '16-Jun', 'Relation with superior', 'Vol', 'Quality Assurance & Control', 26, 'Senior Level'),
 ('AAA_11', 'Trainee', 1, 109730, 'Male', 19, 'NA', 'New', '3 months', 0, 0, 22.5, '16-Dec', 'Asked to Leave: Ethics code violation', 'InVol', 'Research & Development', 23, 'Junior Level'),
 ('AAA_12', 'Trainee', 1, 108512, 'Male', 24, 'NA', 'New', '3 months', 0, 0, 30.0, '17-Mar', 'Background Check Failure', 'InVol', 'Quality Assurance & Control', 4, 'Junior Level'),
 ('AAA_13', 'Trainee', 1, 103786, 'Male', 19, 'NA', 'New', '5 months', 0, 0, 17.5, '16-Oct', 'Background Check Failure', 'InVol', 'Admin', 3, 'Junior Level'),
 ('AAA_14', 'Trainee', 1, 107029, 'Male', 20, 'NA', 'New', '4 months', 0, 0, 17.5, '16-Oct', 'Further Studies', 'Vol', 'Warehouse', 2, 'Junior Level'),
 ('AAA_15', 'Trainee', 1, 107679, 'Male', 19, 'NA', 'New', '11 months', 0, 0, 15.0, '16-Sep', 'Family Reason', 'Vol', 'HR', 20, 'Junior Level'),
 ('AAA_16', 'Trainee', 1, 105218, 'Female', 18, 'NA', 'New', '11 months', 0, 0, 20.0, '16-Nov', 'Family Reason', 'Vol', 'Warehouse', 17, 'Junior Level'),
 ('AAA_17', 'Trainee', 1, 108739, 'Male', 23, 'NA', 'New', '9 months', 0, 0, 27.5, '17-Feb', 'Family Reason', 'Vol', 'Quality Assurance & Control', 27, 'Junior Level')]

In [201]:

%%sql
SELECT 
    COUNT(*) AS Total_Employees
FROM 
    case_attrition_mesotime;

 * mysql://root:***@localhost:3306/attrition_analysis
1 rows affected.

[(100,)]

## Exploring the Dataset
###### We can analyze various factors that could influence why employees are leaving the company, both voluntarily and involuntarily.

##### 1. What percentage of employees left voluntarily vs. involuntarily?

In [202]:
%%sql
SELECT 
    Vol_InVol, 
    ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM case_attrition_mesotime), 0) AS Percentage
FROM 
    case_attrition_mesotime
GROUP BY
    Vol_InVol;

 * mysql://root:***@localhost:3306/attrition_analysis
3 rows affected.

[('Vol', Decimal('69')), ('InVol', Decimal('20')), ('Others', Decimal('11'))]

Percentage of employees who left voluntarily: 69%
Percentage of employees who left involuntarily: 20%

The remaining 11% likely represents other reasons or categories not specified.

##### 2. Which Gender had the highest attrition rate?

In [203]:
%%sql
SELECT
    Gender, COUNT(*) AS Attrition_Rate
FROM 
    case_attrition_mesotime
GROUP BY
    Gender;

 * mysql://root:***@localhost:3306/attrition_analysis
2 rows affected.

[('Female', 27), ('Male', 73)]

Among the demographic groups, male employees experienced the highest attrition rate

##### 3. How does attrition vary by performance rating (A+, A, Z)
###### According to the details given, a ranking table was given for Performance Appraisal Rating which showed that:

| Performance Appraisal Rating Name | % of Employees* |
|:----------------------------------:|:----------------:|
| Star Performer (A+)                | 20%              |
| Average Performer (A)              | 70%              |
| Poor Performer (Z)                 | 10%              |

In [218]:
%%sql
SELECT 
    Performance_Rating_Y2017, COUNT(*) AS Count_Attrition
FROM 
    case_attrition_mesotime
GROUP BY 
    Performance_Rating_Y2017;

 * mysql://root:***@localhost:3306/attrition_analysis
4 rows affected.

[('NA', 53), ('A+', 16), ('A', 20), ('Z', 11)]

Since the ranking was a forced one, majority of the employees who left did not fill in performnace rating but based on the results above, Average performers had the highest attrition rate but not a big difference looking at the start performers.

##### 4. Which Specific position levels  are more likely to leave the company?
###### The management structure given was as follows:

| Management Level | Position Description                                                    |
|:----------------:|:-----------------------------------------------------------------------:|
| 1-Junior Level   | Trainee                                                                 |
| 2-Junior Level   | Junior Executive                                                        |
| 3-Junior Level   | Analyst                                                                 |
| 4-Middle Level   | Biostatistician; Data Scientist; Executive; Scientist; Legal Counsel    |
| 5-Middle Level   | Senior Biostatistician; Senior Scientist; Manager; Senior Legal Counsel |
| 6-Senior Level   | Principal Biostatistician; Senior Manager                               |
| 7-Senior Level   | Program Director                                                        |
| 8-Senior Level   | Director                                                                |

In [205]:
%%sql
SELECT 
    Position, COUNT(*) AS Number_of_Attrition
FROM case_attrition_mesotime
GROUP BY Position
ORDER BY Number_of_Attrition DESC;

 * mysql://root:***@localhost:3306/attrition_analysis
14 rows affected.

[('Senior Manager', 18),
 ('Executive', 18),
 ('Manager', 14),
 ('Trainee', 12),
 ('Director', 8),
 ('Analyst', 8),
 ('Scientist', 8),
 ('Senior Scientist', 7),
 ('Senior Legal Counsel', 2),
 ('Program Director', 1),
 ('Data Scientist', 1),
 ('Principal Biostatistician', 1),
 ('Junior Executive', 1),
 ('Biostatistician', 1)]

#### We can dig deeper to understand which management level had the highest attrition based on the table above (Management Level column). To do this, I created a new column named management_level

In [206]:
%%sql
ALTER TABLE attrition_analysis.case_attrition_mesotime
ADD Management_Level VARCHAR (255);


UPDATE attrition_analysis.case_attrition_mesotime
SET Management_Level = CASE
    WHEN Level = 1 THEN 'Junior Level'
    WHEN Level = 2 THEN 'Junior Level'
    WHEN Level = 3 THEN 'Junior Level'
    WHEN Level = 4 THEN 'Middle  Level'
    WHEN Level = 5 THEN 'Middle  Level'
    WHEN Level = 6 THEN 'Senior Level'
    WHEN Level = 7 THEN 'Senior Level'
    WHEN Level = 8 THEN 'Senior Level'
END;

 * mysql://root:***@localhost:3306/attrition_analysis
0 rows affected.
100 rows affected.

[]

In [207]:
%%sql
SELECT 
    Management_Level, COUNT(*) AS Number_of_Attrition
FROM
    case_attrition_mesotime
GROUP BY 
    Management_Level
ORDER BY Number_of_Attrition DESC;

 * mysql://root:***@localhost:3306/attrition_analysis
3 rows affected.

[('Middle  Level', 51), ('Senior Level', 28), ('Junior Level', 21)]

##### 5. Which functions have the highest rates of involuntary attrition?

In [208]:
%%sql
SELECT 
    `Function`, 
    COUNT(*) AS Count_of_Attrition
FROM 
    case_attrition_mesotime
GROUP BY 
    `Function`
ORDER BY 
    Count_of_Attrition DESC;

 * mysql://root:***@localhost:3306/attrition_analysis
13 rows affected.

[('Sales & Promotion', 19),
 ('Research & Development', 12),
 ('SCM', 10),
 ('Production', 10),
 ('Warehouse', 8),
 ('HR', 7),
 ('Finance', 7),
 ('Quality Assurance & Control', 5),
 ('Strategy', 5),
 ('IT', 5),
 ('Admin', 4),
 ('Legal', 4),
 ('Internal Audit', 4)]

##### 6. Do employees with more years of internal or external experience have higher or lower attrition rates?

In [209]:
%%sql
SELECT 
    CASE 
        WHEN Internal_years_of_exp > External_years_of_exp THEN 'More Internal Experience'
        WHEN Internal_years_of_exp < External_years_of_exp THEN 'More External Experience'
        ELSE 'Equal Experience'
    END AS Experience_Type,
    COUNT(*) AS Total_Employees,
    SUM(CASE WHEN Vol_InVol = 'Vol' THEN 1 ELSE 0 END) AS Voluntary_Attrition,
    SUM(CASE WHEN Vol_InVol = 'InVol' THEN 1 ELSE 0 END) AS Involuntary_Attrition,
    ROUND(SUM(CASE WHEN Vol_InVol = 'Vol' THEN 1 ELSE 0 END) * 100.0 / COUNT(*), 2) AS Voluntary_Attrition_Rate,
    ROUND(SUM(CASE WHEN Vol_InVol = 'InVol' THEN 1 ELSE 0 END) * 100.0 / COUNT(*), 2) AS Involuntary_Attrition_Rate
FROM 
    case_attrition_mesotime
GROUP BY 
    Experience_Type;

 * mysql://root:***@localhost:3306/attrition_analysis
3 rows affected.

[('More Internal Experience', 33, Decimal('22'), Decimal('8'), Decimal('66.67'), Decimal('24.24')),
 ('More External Experience', 63, Decimal('45'), Decimal('11'), Decimal('71.43'), Decimal('17.46')),
 ('Equal Experience', 4, Decimal('2'), Decimal('1'), Decimal('50.00'), Decimal('25.00'))]

##### 7. How does attrition vary across different age groups

In [210]:
%%sql
SELECT
    CASE
        WHEN Age BETWEEN 18 AND 25 THEN '18-25'
        WHEN Age BETWEEN 26 AND 35 THEN '26-35'
        WHEN Age BETWEEN 36 AND 45 THEN '36-35'
        WHEN Age > 45 THEN '46+'
    END AS Age_Group,
    COUNT(*) AS Attrition_Count
FROM
    case_attrition_mesotime
GROUP BY Age_Group
ORDER BY Attrition_Count DESC;

 * mysql://root:***@localhost:3306/attrition_analysis
4 rows affected.

[('26-35', 30), ('36-35', 29), ('46+', 24), ('18-25', 17)]

##### 8. What are the top 5 reasons employees left voluntarily?

In [211]:
%%sql
SELECT
    Reason_for_leaving, COUNT(*) AS Count
FROM
    case_attrition_mesotime
WHERE
    Vol_InVol = 'Vol'
GROUP BY
    Reason_for_leaving
ORDER BY
    Count DESC
LIMIT
    5;

 * mysql://root:***@localhost:3306/attrition_analysis
5 rows affected.

[('Relation with superior', 22),
 ('Better opportunity', 8),
 ('Further Studies', 7),
 ('Family Reason', 7),
 ('Job dissatisfaction', 7)]

##### 9. How many A+ rated employees (Star Performers) have left the company, and what were their reasons for leaving?

In [212]:
%%sql
SELECT
    Reason_for_leaving, COUNT(*) AS Count
FROM
    case_attrition_mesotime
WHERE 
    Performance_Rating_Y2017 = 'A+'
GROUP BY
    Reason_for_leaving
ORDER BY
    Count DESC;

 * mysql://root:***@localhost:3306/attrition_analysis
6 rows affected.

[('Relation with superior', 9),
 ('Moving abroad within the company', 2),
 ('Did not return from pregnancy', 2),
 ('Better opportunity', 1),
 ('Job dissatisfaction', 1),
 ('Retirement', 1)]

##### 10. Why are Men Leaving?

In [213]:
%%sql
SELECT
    Reason_for_leaving, COUNT(*) AS Count
FROM 
    case_attrition_mesotime
WHERE
    Gender = 'Male'
GROUP BY
    Reason_for_leaving
ORDER BY
    Count DESC;

 * mysql://root:***@localhost:3306/attrition_analysis
14 rows affected.

[('Relation with superior', 15),
 ('Poor Performance', 9),
 ('Better opportunity', 7),
 ('Bored and unchallenged by the work itself', 7),
 ('Background Check Failure', 5),
 ('Family Reason', 5),
 ('Further Studies', 4),
 ('Death', 4),
 ('Limited growth', 4),
 ('Job dissatisfaction', 4),
 ('Asked to Leave: Ethics code violation', 3),
 ('Better Salary Hike', 3),
 ('Retirement', 2),
 ('Moving abroad within the company', 1)]

##### 11. Why are Women Leaving?

In [214]:
%%sql
SELECT
    Reason_for_leaving, COUNT(*) AS Count
FROM
    case_attrition_mesotime
WHERE
    Gender = 'Female'
GROUP BY
    Reason_for_leaving
ORDER BY
    Count DESC;

 * mysql://root:***@localhost:3306/attrition_analysis
11 rows affected.

[('Relation with superior', 7),
 ('Did not return from pregnancy', 4),
 ('Job dissatisfaction', 3),
 ('Further Studies', 3),
 ('Family Reason', 2),
 ('Death', 2),
 ('Poor Performance', 2),
 ('Better opportunity', 1),
 ('Retirement', 1),
 ('Moving abroad within the company', 1),
 ('Background Check Failure', 1)]

#### Conclusion
The analysis indicates that the primary reason for employee turnover is poor performance management by superiors. Notably, a higher number of male employees left the company compared to their female counterparts. Among the females who departed, a significant portion did not return due to pregnancy-related issues. It is also noteworthy that most exits were voluntary, with poor relationships with supervisors being the predominant reason cited. Furthermore, middle-level employees exhibited the highest attrition rates, suggesting that this group may be particularly vulnerable to dissatisfaction. Interestingly, employees with more external years of experience also demonstrated a higher rate of voluntary attrition.

#### Recommendation
My overall advice to the company is to prioritize employee retention by fostering a supportive and engaging workplace environment. This begins with investing in training programs for supervisors to enhance their skills in building positive relationships with their teams. Given that poor relationships with superiors are the leading cause of voluntary turnover, equipping managers with effective communication and performance management techniques is essential. Additionally, the company should implement stay interviews to proactively engage with employees, allowing them to express their concerns and motivations for remaining with the organization.

To deepen our understanding of employee turnover, conducting a situational analysis. This approach can help identify patterns and predict which employees are more likely to leave the company in the future.